package secondTask;



/**
 * Второе это картинка с пояснениями что прислала- Допустим у нас есть форма для тестирования,
 * она содержит 2 поля для ввода числового значения (a, b) и окно вывода результата (c) выполнения
 * арифметической операции деления или умножения в зависимости от введенных a и b.
 * Требования для параметров зафиксированы в верхнем левом углу схемы.
 * Как бы вы протестировали данную схему с учетом требований?
 * Результат предоставить в виде таблицы со столбцами а, b, c (тестовые данные и ожидаемый результат )
 */

public class AbcNumbers {
    public static void main(String[] args) {
    }
}